def task1(bytes, pages, strings, symbols):
    all_symbols = pages * strings * symbols
    bits = bytes * 8
    result = 2 ** (bits / all_symbols)  # <- в скобках объём информции 1 символа
    return int(result)


from math import log2


def task2(alf_power_one, alf_power_two):
    one_alf_symbol_weight = int(log2(alf_power_one))
    two_alf_symbol_weight = int(log2(alf_power_two))
    return one_alf_symbol_weight / two_alf_symbol_weight


def task3(alf_power, bits):
    one_symbol_weight = int(log2(alf_power))
    return int(bits / one_symbol_weight)


def task4(white_bit, blue_used):
    blue_i = 1 / (2 ** white_bit)
    brown_quantity = (blue_used / blue_i) - (blue_used * 2)
    # Пояснение(при данных из задачи):
    # (blue_used(8 банок синей) / blue_i(шанс синию банкуна = шанс на белую, т.е 2 ** 2(бита))) - (8 cиних банок * 2, т.к белых такое же количество) = 32 - 16 = 16 коричевых банок
    return int(brown_quantity)


def task5(bits):
    floors_or_padiki = 2 ** bits
    return int(floors_or_padiki)


# def task6(bits):
#     padiki = 2 ** bits
#     return int(padiki)

if __name__ == "__main__":
    # Кибернетические задачи:
    # №18
    # var1, var2, var3, var4 = int(input("Объём(в байтах): ")), int(input("Кол-во страниц: ")), int(input("Кол-во строк на странице: ")), int(input("Кол-во символов в строке: "))
    # print(f"Мощность алфавита: {task1(var1, var2, var3, var4)} символа")
    # ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
    # №19
    # var1, var2 = int(input("Наибольшая мощность алфовита: ")), int(input("Наменьшая мощность алфавита: "))
    # print(f"Количество информации в 1-ом тексте больше в {task2(var1, var2)} раза, чем во втором")
    # ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
    # №20
    # var1, var2 = int(input("Мощность алфовита: ")), int(input("Объём(в битах): "))
    # print(f"Количество символов в сообщении: {task3(var1, var2)}")
    #
    # Вероятностные задачи:
    # №7
    # var1, var2 = int(input("Объём(в битах) сообщения о том, что закончилась белая краска: ")), int(input("Количество синих банок: "))
    # print(f"Израсходовано {task4(var1, var2)} банок коричневой краски")
    # ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
    # №19
    # var1 = int(input("Объём сообщения(в битах): "))
    # print(f"В доме {task5(var1)} этажа(ей)")
    # ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
    # №20
    # var1 = int(input("Объём сообщения(в битах): "))
    # print(f"В доме {task5(var1)} подъезда(ов)")
    # p.s тут использовал фукнцию из прошлой задачи, т.к решение одно и тоже
    # ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
    pass  # заглушка для закоменченных фукнций выше, чтобы VS(ка) или PyCharm не ругались